Examinator/src/InformationRegisters/ОбщиеНастройкиЭлектронногоОбучения/ОбщиеНастройкиЭлектронногоОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбщиеНастройкиЭлектронногоОбучения</name>
  <resources>
    <name>АдресОбщегоКаталогаНаВебСервере</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПутьКОбщемуКаталогуНаВебСервере</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОбщийКаталогВТонкомКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьВОбщемКаталогеМанифестCMI5</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОбщиеНастройкиЭлектронногоОбучения/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Значение(ИмяНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Настройки."+ИмяНастройки+" КАК ЗначениеНастройки
		|ИЗ
		|	РегистрСведений.ОбщиеНастройкиЭлектронногоОбучения КАК Настройки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		РеквизитРегистра = Метаданные.РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Ресурсы.Найти(ИмяНастройки);
		
		Если РеквизитРегистра = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Ошибочное имя общих настроек электронного обучения'");
		КонецЕсли;
		
		Возврат РеквизитРегистра.Тип.ПривестиЗначение(Неопределено);
		
	Иначе		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();

		Возврат ВыборкаДетальныеЗаписи.ЗначениеНастройки;	
		
	КонецЕсли;
		
КонецФункции

Процедура Сохранить(ИмяНастройки, ЗначениеНастройки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи[ИмяНастройки] = ЗначениеНастройки;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ОбщийКаталогНастроен(Знач АдресОбщегоКаталога = Неопределено, Знач ПутьКОбщемуКаталогу = Неопределено) Экспорт
	
	Если АдресОбщегоКаталога = Неопределено
		ИЛИ ПутьКОбщемуКаталогу = Неопределено Тогда
		
		АдресОбщегоКаталога = РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Значение("АдресОбщегоКаталогаНаВебСервере");
		ПутьКОбщемуКаталогу = РегистрыСведений.ОбщиеНастройкиЭлектронногоОбучения.Значение("ПутьКОбщемуКаталогуНаВебСервере");
		
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(АдресОбщегоКаталога) И ЗначениеЗаполнено(ПутьКОбщемуКаталогу), Истина, Ложь)
	
КонецФункции

#КонецОбласти

#КонецЕсли
